In [1]:
import pandas as pd

In [2]:
df_data = pd.read_csv('supermarket_sales.csv')

In [3]:
df_data.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

In [4]:
#Qual o faturamento total da filial?
df_data.groupby('City')[['Total', 'gross income']].sum()

                 Total  gross income
City
Mandalay   106197.6720     5057.0320
Naypyitaw  110568.7065     5265.1765
Yangon     106200.3705     5057.1605

In [5]:
#Qual a percentual de participação na receita de cada tipo de produto?
(df_data.groupby('Product line')['Total'].sum() / df_data.groupby('Product line')['Total'].sum().sum()).sort_values() * 100

Product line
Health and beauty         15.231828
Home and lifestyle        16.677232
Fashion accessories       16.814702
Electronic accessories    16.824497
Sports and travel         17.067648
Food and beverages        17.384094
Name: Total, dtype: float64

In [6]:
#Como está distribuído o tipo de produto consumido por gênero
df_data.groupby(['Product line', 'Gender'])[['Total']].sum().pivot_table(index='Product line', columns='Gender')

                             Total
Gender                      Female        Male
Product line
Electronic accessories  27102.0225  27235.5090
Fashion accessories     30437.4000  23868.4950
Food and beverages      33170.9175  22973.9265
Health and beauty       18560.9865  30632.7525
Home and lifestyle      30036.8775  23825.0355
Sports and travel       28574.7210  26548.1055

In [7]:
#Qual foi o faturamento por mês?
df_data['Date'] = pd.to_datetime(df_data['Date'])
df_data['Month'] = df_data['Date'].apply(lambda x: x.month)
df_data['Year'] = df_data['Date'].apply(lambda x: x.year)
df_data.groupby(['Month'])['Total'].sum()

Month
1    116291.868
2     97219.374
3    109455.507
Name: Total, dtype: float64

In [8]:
#Qual foi a média de avaliação por cada filial em janeiro de 2019
df_data[(df_data['Year'] == 2019) & (df_data['Month'] == 1)]['Rating'].mean()

np.float64(7.017613636363635)

In [9]:
#Como se distribui o gasto por tipo de consumidor em cada filial
df_data.groupby(['Customer type', 'City'])['Total'].sum()

Customer type  City
Member         Mandalay     53704.6860
               Naypyitaw    56881.2825
               Yangon       53637.4755
Normal         Mandalay     52492.9860
               Naypyitaw    53687.4240
               Yangon       52562.8950
Name: Total, dtype: float64

In [10]:
import numpy as np

In [11]:
labels = ['a', 'b', 'c']
minha_lista = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

In [12]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [13]:
pd.Series(data=labels, index=minha_lista) #Poderia ter feito pd.Series(labels, minha_lista) que daria o mesmo resultado

10    a
20    b
30    c
dtype: object

In [14]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
ser1 = pd.Series([1,2,3,4],index=['EUA', 'Alemanha', 'Russia', 'Japão'])

In [16]:
ser1

EUA         1
Alemanha    2
Russia      3
Japão       4
dtype: int64

In [17]:
ser2 = pd.Series([1,2,5,4],index=['EUA', 'Alemanha', 'Italia', 'Japão'])
ser2

EUA         1
Alemanha    2
Italia      5
Japão       4
dtype: int64

In [18]:
ser1['EUA']

np.int64(1)

In [19]:
ser1[['Alemanha','Russia']]

Alemanha    2
Russia      3
dtype: int64

In [20]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Italia      NaN
Japão       8.0
Russia      NaN
dtype: float64

###DataFrames

In [21]:
from numpy.random import randn

In [22]:
df = pd.DataFrame(randn(5,4), index=['A',"B",'C','D','E'], columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.566717 -0.910966  0.774500 -0.088321
B -1.252276  0.884455 -0.141505  0.082633
C -0.208120 -2.311104 -0.010881 -1.146645
D  0.679141 -2.257158 -0.253187  0.463109
E  1.558021 -0.393623  1.656061  2.262596

In [23]:
df['W']

A    0.566717
B   -1.252276
C   -0.208120
D    0.679141
E    1.558021
Name: W, dtype: float64

In [24]:
df[['W']]

          W
A  0.566717
B -1.252276
C -0.208120
D  0.679141
E  1.558021

In [25]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.566717 -0.910966  0.774500 -0.088321  1.341217
B -1.252276  0.884455 -0.141505  0.082633 -1.393781
C -0.208120 -2.311104 -0.010881 -1.146645 -0.219001
D  0.679141 -2.257158 -0.253187  0.463109  0.425955
E  1.558021 -0.393623  1.656061  2.262596  3.214082

In [26]:
df.drop('new', axis=1) #ais = 1 corresponde a colunas e axis =0 linhas

          W         X         Y         Z
A  0.566717 -0.910966  0.774500 -0.088321
B -1.252276  0.884455 -0.141505  0.082633
C -0.208120 -2.311104 -0.010881 -1.146645
D  0.679141 -2.257158 -0.253187  0.463109
E  1.558021 -0.393623  1.656061  2.262596

In [27]:
df

          W         X         Y         Z       new
A  0.566717 -0.910966  0.774500 -0.088321  1.341217
B -1.252276  0.884455 -0.141505  0.082633 -1.393781
C -0.208120 -2.311104 -0.010881 -1.146645 -0.219001
D  0.679141 -2.257158 -0.253187  0.463109  0.425955
E  1.558021 -0.393623  1.656061  2.262596  3.214082

In [28]:
df.drop('new', axis=1, inplace=True) #retira a coluna new do arquivo original

In [29]:
df

          W         X         Y         Z
A  0.566717 -0.910966  0.774500 -0.088321
B -1.252276  0.884455 -0.141505  0.082633
C -0.208120 -2.311104 -0.010881 -1.146645
D  0.679141 -2.257158 -0.253187  0.463109
E  1.558021 -0.393623  1.656061  2.262596

In [30]:
df.loc['A']

W    0.566717
X   -0.910966
Y    0.774500
Z   -0.088321
Name: A, dtype: float64

In [31]:
df.loc[['A', 'B']]

          W         X         Y         Z
A  0.566717 -0.910966  0.774500 -0.088321
B -1.252276  0.884455 -0.141505  0.082633

In [32]:
df.iloc[0,2] #primeiro valor será a linha e o segundo a coluna para acessar uma célula da tabela

np.float64(0.7745002168018712)

In [33]:
df.iloc[:-1, :]

          W         X         Y         Z
A  0.566717 -0.910966  0.774500 -0.088321
B -1.252276  0.884455 -0.141505  0.082633
C -0.208120 -2.311104 -0.010881 -1.146645
D  0.679141 -2.257158 -0.253187  0.463109

In [34]:
df.iloc[1:4, 1:3]

          X         Y
B  0.884455 -0.141505
C -2.311104 -0.010881
D -2.257158 -0.253187

In [35]:
df + df

          W         X         Y         Z
A  1.133433 -1.821932  1.549000 -0.176643
B -2.504552  1.768910 -0.283009  0.165265
C -0.416241 -4.622207 -0.021762 -2.293290
D  1.358283 -4.514316 -0.506374  0.926218
E  3.116043 -0.787245  3.312121  4.525191

In [36]:
df > 0

       W      X      Y      Z
A   True  False   True  False
B  False   True  False   True
C  False  False  False  False
D   True  False  False   True
E   True  False   True   True

In [37]:
df[df > 0]

          W         X         Y         Z
A  0.566717       NaN  0.774500       NaN
B       NaN  0.884455       NaN  0.082633
C       NaN       NaN       NaN       NaN
D  0.679141       NaN       NaN  0.463109
E  1.558021       NaN  1.656061  2.262596

In [38]:
df['Y'] > 0

A     True
B    False
C    False
D    False
E     True
Name: Y, dtype: bool

In [39]:
df[df['X'] > 0]

          W         X         Y         Z
B -1.252276  0.884455 -0.141505  0.082633

In [40]:
df[(df['X'] > 0) & (df['W'] > 0)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [41]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [42]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [43]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.566717 -0.910966  0.774500 -0.088321
1     B -1.252276  0.884455 -0.141505  0.082633
2     C -0.208120 -2.311104 -0.010881 -1.146645
3     D  0.679141 -2.257158 -0.253187  0.463109
4     E  1.558021 -0.393623  1.656061  2.262596

In [44]:
df

          W         X         Y         Z
A  0.566717 -0.910966  0.774500 -0.088321
B -1.252276  0.884455 -0.141505  0.082633
C -0.208120 -2.311104 -0.010881 -1.146645
D  0.679141 -2.257158 -0.253187  0.463109
E  1.558021 -0.393623  1.656061  2.262596

In [45]:
df.reset_index(inplace=True)
df

  index         W         X         Y         Z
0     A  0.566717 -0.910966  0.774500 -0.088321
1     B -1.252276  0.884455 -0.141505  0.082633
2     C -0.208120 -2.311104 -0.010881 -1.146645
3     D  0.679141 -2.257158 -0.253187  0.463109
4     E  1.558021 -0.393623  1.656061  2.262596

In [46]:
df.set_index("index", inplace=True)
df

              W         X         Y         Z
index
A      0.566717 -0.910966  0.774500 -0.088321
B     -1.252276  0.884455 -0.141505  0.082633
C     -0.208120 -2.311104 -0.010881 -1.146645
D      0.679141 -2.257158 -0.253187  0.463109
E      1.558021 -0.393623  1.656061  2.262596

In [47]:
novoind = 'CA NY WY OR CO'.split()
novoind

['CA', 'NY', 'WY', 'OR', 'CO']

In [48]:
df['novo_index'] = novoind
df

              W         X         Y         Z novo_index
index
A      0.566717 -0.910966  0.774500 -0.088321         CA
B     -1.252276  0.884455 -0.141505  0.082633         NY
C     -0.208120 -2.311104 -0.010881 -1.146645         WY
D      0.679141 -2.257158 -0.253187  0.463109         OR
E      1.558021 -0.393623  1.656061  2.262596         CO

In [49]:
df.set_index('novo_index')
df

              W         X         Y         Z novo_index
index
A      0.566717 -0.910966  0.774500 -0.088321         CA
B     -1.252276  0.884455 -0.141505  0.082633         NY
C     -0.208120 -2.311104 -0.010881 -1.146645         WY
D      0.679141 -2.257158 -0.253187  0.463109         OR
E      1.558021 -0.393623  1.656061  2.262596         CO

###Índices multiníveis

In [50]:
#Níveis de Índices 
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))

In [51]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [53]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [55]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A','B']) #6 linhas e 2 colunas
df

             A         B
G1 1  0.456365 -0.346228
   2 -1.200941 -0.686191
   3  0.059734  0.182371
G2 1 -0.115859 -2.162727
   2  0.244424 -0.435458
   3 -1.189146  0.467020

In [56]:
df.loc['G1']

          A         B
1  0.456365 -0.346228
2 -1.200941 -0.686191
3  0.059734  0.182371

In [57]:
df.loc['G1'].loc[1]

A    0.456365
B   -0.346228
Name: 1, dtype: float64

In [58]:
df.index.names = ['Grupo', 'Número']
df

                     A         B
Grupo Número
G1    1       0.456365 -0.346228
      2      -1.200941 -0.686191
      3       0.059734  0.182371
G2    1      -0.115859 -2.162727
      2       0.244424 -0.435458
      3      -1.189146  0.467020

In [59]:
df.xs('G1')

               A         B
Número
1       0.456365 -0.346228
2      -1.200941 -0.686191
3       0.059734  0.182371

In [60]:
df.xs(1, level='Número')

              A         B
Grupo
G1     0.456365 -0.346228
G2    -0.115859 -2.162727

###Tratamento de dados ausêntes

In [62]:
df_1 = pd.DataFrame({
    'A': [1,2,np.nan],
    'B': [5,np.nan, np.nan],
    'C': [1,2,3]
})
df_1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df_1.dropna(axis=0) #Corte dos dados nan nas linhas -> axis = 0

     A    B  C
0  1.0  5.0  1

In [65]:
df_1.dropna(axis=1) #Corte dos dados nan nas colunas -> axis =1

   C
0  1
1  2
2  3

In [ ]:
df_1.dropna(axis = 1, thresh=2) #O corte irá acontecer nas colunas que tiverem dois ou mais nan -> thresh = 2 -> limite >= 2

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [69]:
df_1.fillna(0) # preenche os dados nan com 0 -> fillna(0) -> poderia ser qualquer coisa no lugar do 0, até uma string 'conteúdo'

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [70]:
df_1['A'].sum() #Vai somar os valores da coluna A
df_1['A']. mean() #Média dos valores da coluna A

np.float64(1.5)

In [72]:
df_1['A'].fillna(value=df_1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [73]:
df_1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df_1.ffill() #Preenche os nan com o último valor acima
#df_1.bfill() vai preencher com os valores de baixo

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

###Groupby

In [113]:
data = {
    'Classe': ['Júnior', 'Júnior', 'Pleno', 'Pleno', 'Sênior', 'Sênior'],
    'Nome': ['Jorge', 'Carlos', 'Roberta', 'Patrícia', 'Bruno', 'Vera'],
    'Venda': [200,120,340,124,243,350]
}

In [114]:
df_2 = pd.DataFrame(data)
df_2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [115]:
group = df_2.groupby('Classe')

In [116]:
group.sum()

                   Nome  Venda
Classe
Júnior      JorgeCarlos    320
Pleno   RobertaPatrícia    464
Sênior        BrunoVera    593

In [117]:
group_2 = df_2.groupby("Classe").min() #Quem vendeu menos
group_2

            Nome  Venda
Classe
Júnior    Carlos    120
Pleno   Patrícia    124
Sênior     Bruno    243

In [118]:
group_2 = df_2.groupby('Classe').max()
group_2

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior     Vera    350

In [119]:
df_2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [120]:
df_3 = df_2.copy()

In [121]:
df_3['Venda'] = [150,432,190,230,410,155]

In [122]:
df_3

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [123]:
df_2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [124]:
df_4 = pd.concat([df_2,df_3])
df_4

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [128]:
group_3 = df_4.groupby(['Classe', 'Nome']).sum()
group_3

                 Venda
Classe Nome
Júnior Carlos      552
       Jorge       350
Pleno  Patrícia    354
       Roberta     530
Sênior Bruno       653
       Vera        505